In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']}
                  )

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
From=[]
To=[]
for i in df['From_To']:
  s=(i.split('_'))
  From.append(s[0])
  To.append(s[1])

In [5]:
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [6]:
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [7]:
df['From']=From
df['To']=To

In [8]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

In [9]:
df.drop('From_To',axis=1,inplace=True)

In [10]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1           NaN            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [11]:
def convert(p1):
  return p1[0].upper()+p1[1:].lower()

In [12]:
df['From']=df['From'].apply(convert)

In [13]:
df['To']=df['To'].apply(convert)

In [14]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [15]:
l1=[]
for i in range(len(df['RecentDelays'])):
  l1.append(df['RecentDelays'][i])

In [16]:
l1

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [17]:
Data=pd.DataFrame(l1,columns=['delay1','delay2','delay3'])

In [18]:
Data

   delay1  delay2  delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [28]:
Frames=[df,Data]

In [31]:
New_df=pd.concat(Frames,axis=1)

In [32]:
New_df

   FlightNumber              Airline      From  ... delay1  delay2  delay3
0       10045.0               KLM(!)    London  ...   23.0    47.0     NaN
1           NaN    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2       10065.0  (British Airways. )    London  ...   24.0    43.0    87.0
3           NaN       12. Air France  Budapest  ...   13.0     NaN     NaN
4       10085.0          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]

In [43]:
New_df['FlightNumber'].fillna(value=0,inplace=True)

In [44]:
New_df

   FlightNumber              Airline      From  ... delay1  delay2  delay3
0       10045.0               KLM(!)    London  ...   23.0    47.0     NaN
1           0.0    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2       10065.0  (British Airways. )    London  ...   24.0    43.0    87.0
3           0.0       12. Air France  Budapest  ...   13.0     NaN     NaN
4       10085.0          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]

In [45]:
New_df['FlightNumber']=New_df['FlightNumber'].astype('int64')

In [46]:
New_df

   FlightNumber              Airline      From  ... delay1  delay2  delay3
0         10045               KLM(!)    London  ...   23.0    47.0     NaN
1             0    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2         10065  (British Airways. )    London  ...   24.0    43.0    87.0
3             0       12. Air France  Budapest  ...   13.0     NaN     NaN
4         10085          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]

In [84]:
def test(p1):
  count=10045
  if p1==0:
    return count+10
  else:
    return p1

In [85]:
New_df['FlightNumber']=New_df['FlightNumber'].apply(test)

In [86]:
New_df

   FlightNumber              Airline      From  ... delay1  delay2  delay3
0         10045               KLM(!)    London  ...   23.0    47.0     NaN
1            10    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2         10065  (British Airways. )    London  ...   24.0    43.0    87.0
3            10       12. Air France  Budapest  ...   13.0     NaN     NaN
4         10085          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]